-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-03-21 12:05:57
-- 服务器版本： 10.1.21-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news`
--

-- --------------------------------------------------------

--
-- 表的结构 `baidunews`
--

CREATE TABLE `baidunews` (
  `id` int(11) NOT NULL,
  `newstype` char(200) NOT NULL,
  `newstitle` varchar(200) NOT NULL,
  `newsimg` varchar(300) NOT NULL,
  `newstime` date NOT NULL,
  `newssrc` char(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- 转存表中的数据 `baidunews`
--

INSERT INTO `baidunews` (`id`, `newstype`, `newstitle`, `newsimg`, `newstime`, `newssrc`) VALUES
(0, '科技', '柔妹子扭成联通标识 网友：充话费送对象了', './img/科技/news-5.jpeg', '2017-02-09', '运营商'),
(1, '精选', '经济危机', './img/精选/lg.jpeg', '2017-02-05', '热点'),
(2, '精选', '习近平：1月关键词“牵挂”', './img/精选/news-img.jpg', '2017-02-10', '热点'),
(3, '精选', '【网络媒体走转改】一个创新型民营企业的光明使命', './img/精选/first.jpg', '2017-02-09', '热点'),
(4, '精选', '王宝强：不会放弃孩子抚养权 相信法律公正', './img/精选/wangbaoqiang.jpeg', '2017-02-10', '凤凰要闻'),
(5, '百家', '河南省“全省商务工作会议”在郑州召开  省外地驻豫经贸机构协会参会', './img/百家/meetting.jpeg', '2017-02-10', '腾讯新闻'),
(7, '百家', '不了解谷歌有多强大！来看看Google全家桶！', './img/百家/google-1.jpeg', '2017-02-09', '百度新闻'),
(8, '百家', '农村包围城市！ 快手视频这样就火了？', './img/百家/countryside.jpeg', '2017-02-08', '热点'),
(9, '百家', '新房收房验房注意这些事项，一点都不能错过', './img/百家/home.jpeg', '2017-02-07', '热点'),
(10, '百家', '微信小程序满月：简直一场噩梦！', './img/百家/weixin.png', '2017-02-06', '凤凰'),
(11, '本地', '首汽约车斩获网约车资质 国内权威媒体集体点赞', './img/本地/news-1.jpeg', '2017-02-08', '热点'),
(12, '本地', '王俊凯粉丝“陪考”：28小时火车就想给他送封信', './img/本地/news-2.jpeg', '2017-02-09', '热点'),
(13, '本地', '这个被网友封为“新女神”的女排小将，背景果然不简单', './img/本地/news-3.jpeg', '2017-02-01', '搜狐新闻'),
(14, '本地', '北京持续大风天气 市民包裹严实', './img/本地/news-4.jpeg', '2017-02-07', '都市报'),
(15, '本地', '外地童乞扎堆进京 零童乞必须成为社会应有的底线', './img/本地/news-5.jpeg', '2017-02-09', '人民日报'),
(16, '娱乐', '辽宁卫视《欢天喜地闹元宵》 春晚最受欢迎大联播', './img/娱乐/news-1.jpeg', '2017-02-05', '小米'),
(17, '娱乐', '《围炉音乐会》与格莱美深度合作 分享华语好音乐', './img/娱乐/news-2.jpeg', '2017-02-07', '凤凰新闻'),
(18, '娱乐', '《脑洞大开》第一季收官 科学连环秀嗨翻全场', './img/娱乐/news-3.jpeg', '2017-02-08', '杭州晚报'),
(19, '娱乐', '《歌手》杜丽莎元宵猜灯谜  网友：Teresa真是歌手的宝藏', './img/娱乐/news-4.jpeg', '2017-02-03', '腾讯'),
(20, '娱乐', '《歌手》赵雷弹《理想》 迪玛希首唱中文歌', './img/娱乐/news-5.jpeg', '2017-02-08', '百度'),
(21, '社会', '浙江官员开房信息被公开卧轨自杀 泄密警察获刑', './img/社会/news-1.jpeg', '2017-02-05', '热点'),
(22, '社会', '滞留印度54年中国老兵计划今日乘飞机回国(图)', './img/社会/news-2.jpeg', '2017-02-08', '新闻'),
(23, '社会', '女婴被患病父母遗弃在冰天雪地里 幸获救助', './img/社会/news-3.jpeg', '2017-02-07', '社会'),
(24, '社会', '王林今晨心跳骤停抢救中 律师:开光传闻纯属谣言', './img/社会/news-4.png', '2017-02-03', '搜狐'),
(25, '军事', '韩美表态，朝鲜可造60枚核弹头！', './img/军事/news-1.jpeg', '2017-02-09', '网易头条'),
(26, '军事', '俄方回应\"误炸土耳其部队\":双方坐标信息不一致', './img/军事/news-2.png', '2017-02-08', '腾讯头条'),
(27, '军事', '疑因萨德遭殃?乐天沈阳项目被叫停 未来堪忧', './img/军事/news-3.jpeg', '2017-02-09', '热点'),
(28, '军事', '日本银行业巨头面临2.3亿天价罚单，和英国伊朗有关！', './img/军事/news-4.jpeg', '2017-02-09', '热点'),
(29, '军事', '美称美军航母频繁进南海成就中国史无前例造舰狂潮', './img/军事/news-5.jpeg', '2017-02-09', '百度热点'),
(30, '女人', '女性春季吃蔬菜讲究 四多三少最养人', './img/女人/news-6.jpeg', '2017-02-09', '热点'),
(31, '女人', '美容院分享重要的女性健康美容养生知识！', './img/女人/news-5.png', '2017-02-10', '网易头条'),
(32, '女人', '同是紫色裙装，杨幂和杨蓉两人的差距还真大', './img/女人/news-4.jpeg', '2017-02-10', '网易头条'),
(33, '女人', '铁打的郭子，流水的嫂子！郭冬临的后宫们如今都是什么样？', './img/女人/news-3.jpeg', '2017-02-08', '腾讯头条'),
(34, '女人', '清晨起床脸部浮肿了怎么办？教你三招速度急救', './img/女人/news-2.png', '2017-02-08', '百度视频'),
(35, '女人', '不甘寂寞？还是害怕孤单？这些星座太粘人了，有你吗？', './img/女人/news-1.jpeg', '2017-02-08', '腾讯视频'),
(36, '搞笑', '带男朋友回家，我拉着他的手说，我养了2只大白兔，你要不要看？', './img/搞笑/news-1.jpeg', '2017-02-08', '腾讯新闻'),
(37, '搞笑', '上厕所嗙的一声放了巨响的屁，隔壁哥们差点吓尿了！', './img/搞笑/news-2.png', '2017-02-09', '网易新闻'),
(38, '搞笑', '重庆人的骄傲！秦玥飞获选2016年度《感动中国》人物！大写的牛！', './img/搞笑/news-3.jpeg', '2017-02-09', '网易新闻'),
(39, '搞笑', '对面的哥哥一口冰红茶没喷出来，从武夷山咳到了福州', './img/搞笑/news-4.jpeg', '2017-02-09', '网易'),
(40, '搞笑', '嗅觉迟钝到一种境界了', './img/搞笑/news-5.jpeg', '2017-02-09', '搜狐'),
(41, '搞笑', '京城的哥用随身武器鄙视了交通！', './img/搞笑/news-6.png', '2017-02-09', '人民日报'),
(42, '互联网', '刘强东:京东正申请保险牌照 未来还要开银行', './img/互联网/news-1.png', '2017-02-10', 'B2C'),
(43, '互联网', '新浪理财师诚邀投机精英入驻 打造您专属投顾平台', './img/互联网/news-2.jpeg', '2017-02-10', '期货'),
(44, '互联网', '今日资本徐新：要么大要么死！如何投中800倍回报的行业巨无霸？', './img/互联网/news-3.jpeg', '2017-02-10', '徐新'),
(45, '互联网', '从电商巨头到边缘小弟, 十年间当当网走错了哪一步?', './img/互联网/news-4.jpg', '2017-02-10', '3c电商'),
(46, '互联网', '国美上市部队再添新兵 华银控股更名获通过', './img/互联网/news-5.jpeg', '2017-02-10', '3c电商'),
(47, '互联网', '东南亚电商头条：三星泰国如何颠覆支付宝', './img/互联网/news-6.jpeg', '2017-02-10', 'news'),
(48, '科技', '新型固态防爆电池，被剪碎还能持续供电', './img/科技/news-1.png', '2017-02-10', 'news'),
(49, '科技', '历经十年 欧盟将正式取消手机漫游费', './img/科技/news-2.jpeg', '2017-02-10', '腾讯新闻'),
(50, '科技', 'CA：展望2017年数字经济新时代', './img/科技/news-3.jpeg', '2017-02-10', '数码'),
(51, '科技', '回复“验证码”财产被盗空，腾讯手机管家安全专家解读骗局', './img/科技/news-4.jpg', '2017-02-09', '腾讯管家');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `baidunews`
--
ALTER TABLE `baidunews`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `baidunews`
--
ALTER TABLE `baidunews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
